## Домашнее задание. Основы Pandas

- Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [44]:
ratings = pd.read_csv('ratings.csv')

In [45]:
movie = pd.read_csv('movies.csv')

In [50]:
full_movie = pd.merge(ratings, movie, on='movieId')

In [52]:
only_five = full_movie[full_movie['rating'] == 5.0]
only_five.head()

,userId,movieId,rating,timestamp,title,genres
9,31,1,5.0,850466616,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
12,40,1,5.0,832058959,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
13,43,1,5.0,848993983,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
16,46,1,5.0,834787906,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
19,57,1,5.0,965796031,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy

In [53]:
only_five['movieId'].value_counts().head()

318     153
296     123
356     116
2571    109
260     104
Name: movieId, dtype: int64

In [54]:
full_movie[full_movie['movieId'] == 318].head()

,userId,movieId,rating,timestamp,title,genres
16296,2,318,3.0,1445714835,"Shawshank Redemption, The (1994)",Crime|Drama
16297,5,318,3.0,847434880,"Shawshank Redemption, The (1994)",Crime|Drama
16298,6,318,5.0,845553200,"Shawshank Redemption, The (1994)",Crime|Drama
16299,8,318,5.0,839463489,"Shawshank Redemption, The (1994)",Crime|Drama
16300,11,318,4.0,902155070,"Shawshank Redemption, The (1994)",Crime|Drama

- Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [55]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [ ]:
'Lithuania'
'Latvia'
'Estonia'

In [72]:
my_countries = data[ (data['country'] == 'Lithuania') | (data['country'] == 'Latvia') | (data['country'] == 'Estonia')]
my_countries.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [77]:
sort_year = my_countries[ (my_countries['year'] > 2005) & (my_countries['year'] < 2010) ]

In [78]:
sort_year.head()

       country  year  quantity  category
378  Lithuania  2009     158.0         1
379  Lithuania  2008     100.0         1
380  Lithuania  2007     105.0         1
961  Lithuania  2009       3.0         1
962  Lithuania  2008       9.0         1

In [81]:
sort_category = sort_year[ (sort_year['category'] == 4) | (sort_year['category'] == 12) | (sort_year['category'] == 21) ]

In [82]:
sort_category['category'].sum()

4670

- Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [94]:
page = 'https://www.championat.com/football/_russiapl/tournament/2973/table/'

In [96]:
table_page = pd.read_html(page)

In [100]:
table_page[0]

     №         Команда  Игры   В  Н  П   Мячи  Очки  % очков  Форма
0    1           Зенит    16  11  3  2   31-8    36      750    NaN
1    2     Локомотив М    16   9  4  3  24-16    31      646    NaN
2    3          Ростов    16   9  3  4  29-25    30      625    NaN
3    4            ЦСКА    16   9  3  4  24-16    30      625    NaN
4    5       Краснодар    16   8  6  2  30-18    30      625    NaN
5    6       Спартак М    16   6  3  7  18-16    21      438    NaN
6    7         Арсенал    16   5  4  7  17-21    19      396    NaN
7    8        Оренбург    16   5  4  7  20-22    19      396    NaN
8    9            Урал    16   5  4  7  21-29    19      396    NaN
9   10             Уфа    16   4  6  6  13-16    18      375    NaN
10  11        Динамо М    16   4  6  6  12-16    18      375    NaN
11  12  Крылья Советов    16   5  3  8  18-20    18      375    NaN
12  13           Рубин    16   4  5  7   8-17    17      354    NaN
13  14          Тамбов    16   5  2  9  18-23    17      354    NaN
14  15           Ахмат    16   3  6  7  10-21    15      313    NaN
15  16            Сочи    16   3  4  9  14-23    13      271    NaN